// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const number = Number(prompt('ВВедіть число'));
// console.log(number);
// number === 10 ? alert('Вірно') : alert('Невірно');

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// const min = Math.floor(Math.random() * 60);
// console.log(min);
// if (min < 15) {
//   alert("входить в першу чверть");
// } else if (min >= 15 && min < 30) {
//   alert("входить в другу чверть");
// } else if (min >= 30 && min < 45) {
//   alert("входить в третю чверть");
// } else {
//   alert("входить в четверту чверть");
// };

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//   let sum = 0;

//   for (let i = max; i >= min; i--) {
//     console.log(i);

//     if (i % 2 === 0) {
//       sum += i;
//     }
//   }

//   return sum;
// }
// console.log(getNumbers(2, 6));


// Напиши программу, которая запрашивает у пользователя его имя и выводит приветствие в формате:
// Привет, <имя>!


// let name = prompt("как вас зовут?");
// alert(`Привет, ${name}!`);

// Создай переменную name и присвой ей свое имя.
// Выведи в консоль строку вида:
// Привет, я <имя>!

// let name = "Job";
// console.log(`Привет, я ${name}!`);


// Создай переменную age и присвой ей свой возраст числом.
// Выведи в консоль сообщение:
// Мне <возраст> лет.

// let age = 34;
// console.log(`Мне ${age} лет.`);

// Создай переменные следующих типов:
// строка
// число
// булевое значение (true или false)
// Выведи их в консоль.

// let string = "рядок";
// let Number = 34;
// let boollean = true;
// console.log(string);
// console.log(Number);
// console.log(boollean);


// Создай две переменные a и b, присвой им числа.
// Выведи в консоль их сумму.


// let a = 4;
// let b = 8;
// let sum = a + b;
// console.log(sum);


// function getExtremeElements(array) {
//   const firstElement = array[0];
//   const lastElement = array[array.length -1];
//   return [firstElement, lastElement];
// }
// console.log(getExtremeElements([1, 2, 3, 4, 5]));

// function calculateEngravingPrice(message, pricePerWord) {
  
//   const str = message.split(" ");
//   const sum = str.length;
//   return sum ;
// }

// Створіть змінну з ім'ям name і присвойте їй ваше ім'я.Виведіть це ім'я в консоль.

// const userName = "gregory";
// console.log(userName);

// Створіть змінну age і присвойте їй ваш вік. Виведіть в консоль рядок, що містить ваш вік у такому форматі: "Мені {вік} років".

// let userAge;
// userAge = 25;
// console.log(`"Мені ${userAge} років"`);
// Створіть змінні x і y і присвойте їм довільні числа. Виведіть в консоль результати додавання, віднімання, множення та ділення цих чисел.

// let x = 10;
// let y = 5;
// console.log(x - y);
// console.log(x + y);
// console.log(x * y);
// console.log(x / y);

// Створіть змінну city і присвойте їй назву вашого міста. Створіть рядок, який містить "Я живу в місті {назва міста}", і виведіть його в консоль.
// let city = 'Izmail';
// let message = `"Я живу в місті ${city}"`
// console.log(message);



// Створіть рядок з вашою електронною поштою. Використайте методи рядка, щоб витягнути ваше ім'я та доменну частину. Виведіть обидва ці значення в консоль.

// let myMail = "grisha.burdyuzha3@gmail.com";
// const atIndex = myMail.indexOf("@");
// const userName = myMail.slice(0, atIndex);
// const domain = myMail.slice(atIndex + 1);
// console.log(`ім'я: ${userName}`);
// console.log(`домен: ${domain}`);


// Створіть змінну price і присвойте їй число. Створіть рядок, що містить ціну з символом гривні, наприклад: "Ціна: 500 грн".
// let price = 150;
// let valut = "грн";
// console.log(`"Ціна: ${price} ${valut}"`);




// Створи дві змінні firstName і lastName.
// Присвой їм своє ім'я та прізвище.
// Обєднай ці два рядки в один, з пробілом між ними. Запиши результат в змінну fullName.
// Виведи fullName в консоль.

// const firstName = "Gregory";
// const lastName = "Burdyuzha";
// const fullName = `${firstName} ${lastName}`;
// console.log(fullName);


// Створи дві змінні a і b, присвой їм якісь цілі числа.
// Виконай над ними додавання, віднімання, множення і ділення.
// Запиши результати в змінні sum, difference, product, quotient.
// Виведи всі ці результати в консоль.

// const a = 225;
// const b = 5;
// const sum = a + b;
// const difference = a - b;
// const product = a * b;
// const quotient = a / b;
// console.log(sum, difference, product, quotient);

// Створи змінну radius і присвой їй деяке значення (наприклад, 5).
// Використай формулу площі кола (π * r²) для обчислення площі кола з радіусом, який було встановлено.
// Використовуй значення π = 3.14. Запиши результат у змінну area.
// Виведи area в консоль.

// const radius = 5;
// const pi = 3.14;

// const area = pi * radius* radius;
// console.log(area);

// Створи змінну someString і присвой їй будь-який рядок.
// Обчисли довжину цього рядка, використовуючи властивість .length.
// Виведи довжину рядка в консоль.

// const someString = "lorem45";
// const lengthString = someString.length;
// console.log(lengthString);

// Створи змінну someString і присвой їй будь-який рядок.
// Створи змінну firstLetter і присвой їй першу літеру рядка someString.
// Створи змінну lastLetter і присвой їй останню літеру рядка someString.

// const someString = "hjremasdsa";
// const firstLetter = someString.slice(0,1);
// const lastLetter = someString.slice(-1);
// console.log(someString);
// console.log(`перша: ${firstLetter}`);
// console.log(`Остання: ${lastLetter}`);

// Створи дві змінних str1 та str2.
// Отримай з кожної змінної останню літеру
// Створи третю змінну де обєднай попередні літери
// Приклад: для рядків "HELLO" та "WORLD" результатом буде рядок "OD"

// const str1 = "HELLO";
// const str2 = "WORLD OF TANKS";
// const lastLetter1 = str1.slice(-1);
// const lastLetter2 = str2.slice(-1);
// const addLetter = lastLetter1 + lastLetter2;
// console.log(addLetter);

// Виведіть на екран загальну кількість яблок і винограду.Різницю яблока і винограду теж виведіть у консоль.
// const apples = 47;
// const grapes = 135;
// const total = apples + grapes;
// console.log(total)
// const diff = grapes - apples;
// console.log(diff)

// Замінити вираз перевизначення комбінованим оператором `+=`.


// let students = 100;
// students += 50;
// console.log(students);

// Розбери пріоритет операторів в інструкції визначення значення змінної
// `result`.

// const result = 108 + 223 - 2 * 5;
// console.log(result);

// Склади фразу за допомогою шаблонних рядків `A has B bots in stock`, де A, B -
// змінні вставлені у рядок.


// const companyName = "Cyberdyne Systems";
// const repairBots = 150;
// const defenceBots = 50;
// const total = repairBots + defenceBots;
// const message = `"${companyName} has ${total} bots in stock"`;
// console.log(message); // "Cyberdyne Systems has 200 bots in stock"

// Задача-1
// Напишіть функцію яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює останій літері str2. В іншому випадку функція повинна повернути булеве значення false.

// function message(str1, str2) {
//   const firstLetter3 = str1[0];
//   const lastLetter3 = str2[str2.length - 1];
//   if (firstLetter3 === lastLetter3) {
//     return true;
//   } else {
//     return false;
//   }

  
// }
// console.log(message("Hello", "World"));
// console.log(message("hhhhh", "hhhhhhh"));

// Задача-2
// Напишіть функцію яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює першій літері str2. В іншому випадку функція повинна повернути булеве значення false.

// function foo(str1, str2) {
//   const firstLetter1 = str1[0];
//   const firstLetter2 = str2[0];
//   if (firstLetter1.toLowerCase() === firstLetter2.toLowerCase()) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo("Hello", "World"));
// console.log(foo("Hhhhh", "hhhhhhh"));
// console.log(foo("Hello", "horld"));
// console.log(foo("asdsada", "ghtrr"));

// Задача-3
// Напишіть функцію яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true якщо довжина str1 дорівнює довжині str2. В іншому випадку функція повинна повернути булеве значення false.

// function foo(str1, str2) {
//   if (str1.length === str2.length) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo("Hello", "World"));
// console.log(foo("Hhhhh", "hhhhhhh"));
// console.log(foo("Hello", "horldfddf"));
// console.log(foo("asdsada", "ghtrr"));

// Задача-4
// Напишіть функцію яка приймає число num. Функція повинна повернути булеве значення true якщо кількість цифр у числі парна. В іншому випадку функція повинна повернути булеве значення false.

// function number(num) {
//   return num % 2 === 0;
// }
// console.log(number(4));
// console.log(number(9));

// Задача-5
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 більше, ніж num2. В іншому випадку функція повинна повернути булеве значення false.

// function number(num1, num2) {
//   if (num1 > num2) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(number(4,5));
// console.log(number(9,5));

// Задача-6
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 ділиться на num2 без остачі. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num1, num2) {
//   if (num1 % num2 === 0) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo(4,5));
// console.log(foo(10, 5));

// Задача-7
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num є непарним числом. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num) {
//   if (num % 2 !== 0) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo(4));
// console.log(foo(5));
// console.log(foo(8));
// console.log(foo(0));
// console.log(foo(-2));

// Задача-8
// Напишіть функцію, яка приймає параметр str. Функція повинна повернути булеве значення true, якщо str містить принаймні одну велику літеру. В іншому випадку функція повинна повернути булеве значення false.

// Підказка: допоможе toLowerCase();

// function foo(str) {
//   if (str !== str.toLowerCase()) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo("hello"));
// console.log(foo("Hello"));
// console.log(foo("HELLO"));

// Задача-9
// Напишіть функцію, яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true, якщо довжина str1 більше, ніж довжина str2. В іншому випадку функція повинна повернути булеве значення false.

// function foo(str1, str2) {
//   if (str1.length > str2.length) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo("hello", "hi"));
// console.log(foo("cat", "dog"));
// console.log(foo("short", "longer"));
// console.log(foo("sssss", "lss"));

// Задача-12
// Напишіть функцію, яка приймає рядок str. Функція повинна повернути булеве значення true, якщо str містить хоча б один пробіл. В іншому випадку функція повинна повернути булеве значення false.

// function foo(str) {
//   if (str.includes(' ')) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo("Hello World"));
// console.log(foo("HelloWorld"));

// Задача-15
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 менше або дорівнює num2. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num1, num2) {
//   if (num1 <= num2) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo(25,10));
// console.log(foo(5, 25));
// console.log(foo(5,5));

// Задача-19
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 і num2 рівні. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num1, num2) {
//   if (num1 === num2) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo(5, 5));
// console.log(foo(5, 10));
// console.log(foo('5', 5));

// Задача-20
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num більше або дорівнює нулю. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num) {
//   if (num >= 0) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo(5));
// console.log(foo(0));
// console.log(foo(-3));

// Задача-21
// Напишіть функцію, яка приймає рядок str. Функція повинна повернути булеве значення true, якщо довжина str є парною. В іншому випадку функція повинна повернути булеве значення false.

// function foo(str) {
//   if (str.length % 2 === 0) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo("Test"));
// console.log(foo("Hello"));

// Задача-22
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 ділиться на 2, а num2 не ділиться на 2. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num1, num2) {
//   if (num1 % 2 === 0 && num2 % 2 !== 0) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo(4, 3));
// console.log(foo(4, 2));
// console.log(foo(5, 3));

// Задача-23
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num більше 100, але менше 200. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num) {
//   if (num > 200) {
//     return false;
//   } else if(num > 100) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo(150));
// console.log(foo(50));
// console.log(foo(250));
// console.log(foo(100));
// console.log(foo(200));

// Задача-24
// Напишіть функцію, яка приймає рядок str. Функція повинна повернути булеве значення true, якщо str містить лише маленькі літери. В іншому випадку функція повинна повернути булеве значення false.

// Підказка: допоможе toLowerCase();

// function foo(str) {
//   const lower = str.toLowerCase();
//   if (str === lower) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo("hello"));
// console.log(foo("Hello"));
// console.log(foo("world"));
// console.log(foo("WORLD"));

// Задача-25
// Напишіть функцію, яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true, якщо str1 є частиною str2. В іншому випадку функція повинна повернути булеве значення false.

// function foo(str1, str2) {
//   if (str2.includes(str1)) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo("hello", "hello world"));
// console.log(foo("bye", "hello world"));

// Задача-26
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num є негативним числом. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num) {
//   if (num < 0) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo(-5));
// console.log(foo(0));
// console.log(foo(-10));

// Задача-27
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо різниця між num1 та num2 більше 50. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num1, num2) {
//   if (num1 - num2 > 50) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo(500,50));
// console.log(foo(0,65));
// console.log(foo(100,30));
// console.log(foo(155,60));

// Задача-28
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num є нуль. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num) {
//   if (num === 0) {
//     return true;
//   } else {
//     return false;
//   }
// }
// console.log(foo(0));
// console.log(foo(5));
// console.log(foo(-3));

// Задача-30
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num є кратним 10. В іншому випадку функція повинна повернути булеве значення false.

// function foo(num) {
//   if (num % 10 === 0) {
//     return true;
//   } else {
//     return false;
//   }
// }

// console.log(foo(20));
// console.log(foo(33));
// console.log(foo(50));

// console.log(5 > 4);

// console.log(10 >= '7');

// console.log('2' > '12');

// console.log('2' < '12');

// console.log('4' == 4);

// console.log('6' === 6);

// console.log('false' === false);

// console.log(1 == true);

// console.log(1 === true);

// console.log('0' == false);

// console.log('0' === false);

// console.log('Papaya' < 'papaya');

// console.log('Papaya' === 'papaya');

// console.log(undefined == null);

// console.log(undefined === null);

// Функція makeTransaction коректно обчислює загальну ціну на основі заданих quantity та pricePerDroid.
// Повернутий рядок відформатовано відповідно до специфікації.
// Демонстраційні оператори console.log() правильно включені для показу різних варіантів введення, і вихідні дані відповідають очікуваним результатам.
// Код відповідає інструкціям щодо реалізації, забезпечуючи відсутність невикористаних змінних.

// function makeTransaction(quantity, pricePerDroid) {
//   const total = quantity * pricePerDroid;
//   return total;
// }
// console.log(makeTransaction(5, 2000));

// Оголоси функцію getShippingMessage, яка очікує три параметри, значення яких будуть задаватися під час її виклику: • country — перший параметр, рядок, що містить країну доставки • price — другий параметр, число, що містить загальну вартість товару • deliveryFee — третій параметр, число, що містить вартість доставки товару

// Доповни код функції так, щоб вона повертала рядок з повідомленням про доставку товару в країну користувача: "Shipping to <country> will cost <totalPrice> credits", де: • <country> — це країни доставки • <totalPrice> — це загальна вартість замовлення, що включає вартість товару і його доставки

// Візьми код нижче і встав після оголошення своєї функції для перевірки коректності її роботи. У консоль будуть виведені результати її роботи.

// console.log(getShippingMessage("Australia", 120, 50)); // "Shipping to Australia will cost 170 credits"
// console.log(getShippingMessage("Germany", 80, 20)); // "Shipping to Germany will cost 100 credits"
// console.log(getShippingMessage("Sweden", 100, 20)); // "Shipping to Sweden will cost 120 credits"

// function getShippingMessage(country, price, deliveryFee) {
//   const totalPrice = price + deliveryFee;
//   return `"Shipping to ${country} will cost ${totalPrice} credits"`;
// }
// console.log(getShippingMessage("Australia", 120, 50)); // "Shipping to Australia will cost 170 credits"
// console.log(getShippingMessage("Germany", 80, 20)); // "Shipping to Germany will cost 100 credits"
// console.log(getShippingMessage("Sweden", 100, 20))

// Оголоси функцію getElementWidth, яка очікує три параметри, значення яких будуть задаватися під час її виклику: • content— перший параметр, ширина контенту • padding — другий параметр, значення горизонтального падінгу для кожної зі сторін • border — третій параметр, значення товщини бордера для кожної зі сторін Значення всіх параметрів будуть рядками формату Npx де N — це довільне число, ціле або дробове.

// Доповни код функції так, щоб вона повертала число —загальну ширину елемента. При розрахунку загальної ширини орієнтуйся на те, що значення box-sizing дорівнює border-box.

// Візьми код нижче і встав після оголошення своєї функції для перевірки коректності її роботи. У консоль будуть виведені результати її роботи.

// function getElementWidth(content, padding, border) {
//   const contentWidth = parseFloat(content);
//   const paddingWidth = parseFloat(padding);
//   const borderWidth = parseFloat(border);
//   const totalWidth = contentWidth + paddingWidth * 2 + borderWidth * 2;
//   return totalWidth;
// }

// console.log(getElementWidth("50px", "8px", "4px")); // 74
// console.log(getElementWidth("60px", "12px", "8.5px")); // 101
// console.log(getElementWidth("200px", "0px", "0px")); // 200

// Умова:
// Створи змінну userName і запиши в неї своє ім’я.
// Створи функцію sayHello(), яка виводить у консоль повідомлення
// Привіт, <ім’я>!

// const userName = "Gregory";

// function sayHello() {
//   console.log(`Hello, ${userName}!`);
// }

// sayHello();

// Умова:
// Створи функцію calculateAge(birthYear), яка приймає рік народження і повертає вік користувача.
// Використай поточний рік(наприклад, 2025).

// function calculateAge(birthYear) {
//   const yearNow = 2025;
//   const ageNow = yearNow - birthYear;
//   return ageNow;
// }

// console.log(calculateAge(2008)); // 25
// console.log(calculateAge(1991)); // 30

// Умова:
// Напиши функцію getRectangleArea(width, height),
//   яка обчислює і повертає площу прямокутника.

// function getRectangleArea(width, height) {
//   const area = width * height;
//   return area;
// }
// console.log(getRectangleArea(5, 10)); // 50
// console.log(getRectangleArea(3, 7));  // 21

//   Умова:
// Створи змінні різних типів: число, рядок, булеве значення, null, undefined.
// Напиши функцію checkType(value), яка повертає тип переданого значення.

// const number = 5;
// const string = "Hello world";
// const boollean = true;
// const zero = null;
// const und = undefined;
// function checkType(value) {
//   return typeof (value);
// }
// console.log(checkType(number));
// console.log(checkType(string));
// console.log(checkType(boollean));
// console.log(checkType(zero));
// console.log(checkType(und));


// Створи функцію sum(a, b), яка приймає два числа і повертає їх суму.
// Результат виведи у консоль.

// function sum(a, b) {
//   return a + b;
// }
// console.log(sum(15, 10));

// Створи змінні для опису користувача: ім’я, вік, чи є студентом (true/false).
// Виведи в консоль повідомлення у форматі:

// Ім’я: ..., Вік: ..., Студент: ...
// const userName = "Gregory";
// let userAge = 30;
// let isStudent = true;
// console.log(`Ім’я:${userName}, Вік:${userAge}, Студент:${isStudent}`);

// Напиши програму, яка створює дві змінні a та b і обчислює суму, різницю, добуток та частку цих чисел.
// Виведи результат у консоль у зрозумілому форматі.

// const a = 10;
// const b = 5;
// const sum = a + b;
// const riz = a - b;
// const dob = a * b;
// const chas = a / b;
// console.log(`Сума: ${sum}`);
// console.log(`Різниця: ${riz}`);
// console.log(`Добуток: ${dob}`);
// console.log(`Частка: ${chas}`);


// Задача 3. Перетворення типів

// Створи змінну str = "123" і змінну num = 456.

// Перетвори str на число та склади з num.

// Перетвори num на рядок та об’єднай з str.
// Виведи обидва результати в консоль.

// Мета: зрозуміти різницю між конкатенацією рядків та математичними операціями.

// const str = "123";
// const num = 456;
// const sum1 = Number(str) + num;
// const sum2 = str + String(num);
// console.log(sum1);
// console.log(sum2);



// Задача 4. Проста функція

// Створи функцію greet, яка приймає параметр name та виводить у консоль:

// Привіт, <name>!

// Спробуй викликати функцію з різними іменами кілька разів.

// function greet(name) {
//   console.log(`hello ${name}`);
// }
// greet("gregory");
// greet("vas9");

// Задача 5. Функція з обчисленням

// Напиши функцію calculateArea, яка приймає два параметри: width та height, і повертає площу прямокутника.

// Використай функцію для обчислення площі декількох прямокутників.

// Виведи результати в консоль.

// function calculateArea(width, height) {
//   return width * height;
// }
// const area1 = calculateArea(5, 10);
// const area2 = calculateArea(8, 3);
// const area3 = calculateArea(7, 7);

// console.log(area1);
// console.log(area2);
// console.log(area3);

// Задача 1. Привітання користувача

// Умова:
// Створи функцію sayHello(name), яка приймає ім’я користувача і виводить у консоль повідомлення:

// Привіт, <ім'я>!

// Приклад виклику:

// sayHello("Григорій");
// // Привіт, Григорій!

// function sayHello(name) {
//   console.log(`hello ${name}`);
// }
// sayHello("vas9");

// 🔢 Задача 2. Подвоєння числа

// Умова:
// Створи функцію doubleNumber(num), яка приймає число і повертає його подвоєне значення.
// Результат виведи у консоль.

// Приклад:

// console.log(doubleNumber(7)); // 14

// function doubleNumber(num) {
//   return  num * 2;
// }
// console.log(doubleNumber(25));

// 🧮 Задача 3. Перевірка парності

// Умова:
// Напиши функцію isEven(number), яка повертає true, якщо число парне, і false, якщо непарне.

// function isEven(number) {
//   return number % 2 === 0;
// }

// console.log(isEven(8));
// console.log(isEven(3));



// 🧠 Задача 4. Довжина рядка

// Умова:
// Створи функцію stringLength(str), яка приймає рядок і повертає кількість символів у ньому.

// function stringLength(str) {
//   return str.length;
// }
// console.log(stringLength("JavaScript"));

// 💬 Задача 5. Об’єднання слів

// Умова:
// Створи функцію combineWords(word1, word2), яка повертає новий рядок із двох слів, розділених пробілом.

// function combineWords(word1, word2) {
//   return word1 + " " +  word2;
// }

// console.log(combineWords("Hello", "world Gregory"));

// Задача 4: Перевірка типу

// Напиши функцію checkType(value), яка приймає будь-яке значення і повертає рядок:

// "Це число"

// "Це рядок"

// "Це логічне значення"

// "Невідомий тип"

// Перевір її на значеннях: 42, "JavaScript", true, null.


// function checkType(value) {
//   if (typeof value === "number") {
//     return "Це число";
//   } else if (typeof value === "string") {
//     return "Це рядок";
//   }
//   else if (typeof value === "boolean") {
//     return "Це логічне значення";
//   } else {
//     return "Невідомий тип";
//   }
// }
// console.log(checkType("JavaScript"));
// console.log(checkType("JavaScript"));
// console.log(checkType(true));
// console.log(checkType(null));
// console.log(checkType(45));
// console.log(checkType(false));
// console.log(checkType(0));
// console.log(checkType(undefined));

// Задача 1. Обчислення площі прямокутника

// Створи дві змінні width і height, які зберігають довжину і ширину прямокутника.
// Напиши функцію calculateArea, яка приймає ці дві змінні і повертає площу прямокутника.

// let width = 5;
// let height = 10;
// function calculateArea(width, height) {
//   return width * height;
// }
// console.log(calculateArea(width, height));


// Задача 2. Перевірка парності числа

// Напиши функцію isEven, яка приймає число і повертає true, якщо число парне, і false, якщо непарне.

// function isEven(num) {
//   if (num % 2 === 0) {
//     return true;
//   } else {
//     return false;
//   }
// }

// console.log(isEven(4));
// console.log(isEven(7));

// Задача 3. Об’єднання рядків

// Створи дві змінні firstName і lastName.
// Напиши функцію getFullName, яка об’єднує ці два рядки через пробіл і повертає повне ім’я.

// let firstName = "Ivan";
// let lastName = "Petrenko";
// function getFullName() {
//   return firstName +" "+ lastName;
// }
// console.log(getFullName(firstName, lastName));

// Задача 4. Перетворення типів

// Створи змінну strNumber, яка містить рядок "123".
// Напиши функцію convertToNumber, яка перетворює цей рядок на число і повертає його.

// const strNumber = "123";
// function convertToNumber(strNumber) {
//   return Number(strNumber);
// }
// console.log(convertToNumber(strNumber));

// Задача 5. Обчислення середнього значення

// Напиши функцію calculateAverage, яка приймає три числа і повертає їх середнє арифметичне.

// function caclculateAverage(a, b, c) {
//   return (a + b + c) / caclculateAverage.length;
// }

// console.log(caclculateAverage(15, 3, 15));

// Задача 1: Операції з числами

// Створи дві змінні a і b та присвой їм будь-які числові значення.
// Напиши функцію sumAndMultiply, яка повертає об’єкт з двома властивостями:

// sum — сума чисел,

// product — добуток чисел.

// function sumAndMultiply(a, b) {
//   const sum = a + b;
//   const product = a * b;
//   return `sum:${sum}, product:${product}`;
// }
// console.log(sumAndMultiply(5, 3));

// Задача 3: Останній символ рядка

// Створи функцію getLastChar, яка приймає рядок і повертає його останній символ.

// function getLastChar(str) {
//   return str[str.length - 1];
// }
// console.log(getLastChar("JavaScript"));


// Задача 4: Перетворення рядка в число

// Напиши функцію convertToNumber, яка приймає рядок.

// Якщо рядок можна перетворити на число — повертає це число.

// Якщо не можна — повертає NaN.

// function convertToNumber(str) {
//   const num = Number(str);
//   return isNaN(num) ? NaN : num;
// }

// console.log(convertToNumber("123"));
// console.log(convertToNumber("12.34"));
// console.log(convertToNumber("abc"));
// console.log(convertToNumber(""));
// console.log(convertToNumber(" "));

// Задача 5: Просте привітання

// Створи функцію greet, яка приймає ім’я та вік користувача і повертає рядок у форматі:
// "Привіт, [ім’я]! Тобі [вік] років."

// function greet(userName,userAge) {
//   return `"Привіт, ${userName}! Тобі ${userAge} років."`
// }
// console.log(greet("Олексій", 25));


// Створіть змінну з ім'ям name і присвойте їй ваше ім'я.Виведіть це ім'я в консоль.

// const name = "Gregory";
// console.log(name);


// Створіть змінну age і присвойте їй ваш вік. Виведіть в консоль рядок, що містить ваш вік у такому форматі: "Мені {вік} років".

// const age = 34;
// console.log(`"Мені ${age} років".`);

// Створіть змінні x і y і присвойте їм довільні числа. Виведіть в консоль результати додавання, віднімання, множення та ділення цих чисел.
// const x = 15;
// const y = 3;
// const sum = x + y;
// const vid = x - y;
// const mnoj = x * y;
// const dil = x / y;
// console.log(`sum:${sum},vid:${vid},mnoj:${mnoj},dil:${dil}`);

// Створіть змінну city і присвойте їй назву вашого міста. Створіть рядок, який містить "Я живу в місті {назва міста}", і виведіть його в консоль.

// const city = "Izmail";
// console.log(`"Я живу в місті ${city}"`)


// Створіть змінну price і присвойте їй число. Створіть рядок, що містить ціну з символом гривні, наприклад: "Ціна: 500 грн".

    

// Створи дві змінні firstName і lastName.
// Присвой їм своє ім'я та прізвище.
// Обєднай ці два рядки в один, з пробілом між ними. Запиши результат в змінну fullName.
// Виведи fullName в консоль.
// Створи дві змінні a і b, присвой їм якісь цілі числа.
// Виконай над ними додавання, віднімання, множення і ділення.
// Запиши результати в змінні sum, difference, product, quotient.
// Виведи всі ці результати в консоль.
// Створи змінну radius і присвой їй деяке значення (наприклад, 5).
// Використай формулу площі кола (π * r²) для обчислення площі кола з радіусом, який було встановлено.
// Використовуй значення π = 3.14. Запиши результат у змінну area.
// Виведи area в консоль.
// Створи змінну someString і присвой їй будь-який рядок.
// Обчисли довжину цього рядка, використовуючи властивість .length.
// Виведи довжину рядка в консоль.
// Створи змінну someString і присвой їй будь-який рядок.
// Створи змінну firstLetter і присвой їй першу літеру рядка someString.
// Створи змінну lastLetter і присвой їй останню літеру рядка someString.
// Створи дві змінних str1 та str2.
// Отримай з кожної змінної останню літеру
// Створи третю змінну де обєднай попередні літери
// Приклад: для рядків "HELLO" та "WORLD" результатом буде рядок "OD"
// Створи змінну userValue та запиши до неї будь-яке число.

// Створи нову змінну до якої потрібно записати результат математичної операції а саме:
// userValue помножити на число 5 у степені (кількість цифр у змінній userValue).

// Приклади:
// для числа 1 = 1 * 5^1 = 5;
// для числа 2 = 2 * 5^1 = 10;
// для числа 12 = 12 * 5^2 = 300;
// для числа 512 = 512 * 5^3 = 64000;

// Виведіть на екран загальну кількість яблок і винограду. Різницю яблока і винограду теж виведіть у консоль.

// const apples = 47;
// const grapes = 135;
// const total = ;
// console.log(total)
// const diff = ;
// console.log(diff)

// Замінити вираз перевизначення комбінованим оператором `+=`.


// let students = 100;
// students = students + 50;
// console.log(students);
// Розбери пріоритет операторів в інструкції визначення значення змінної
// `result`.

// const result = 108 + 223 - 2 * 5;
// console.log(result);
// Склади фразу за допомогою шаблонних рядків `A has B bots in stock`, де A, B -
// змінні вставлені у рядок.


// const companyName = "Cyberdyne Systems";
// const repairBots = 150;
// const defenceBots = 50;
// const message = ``;
// console.log(message); // "Cyberdyne Systems has 200 bots in stock"


